1m3_27mm_wall_H2/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 4.6e-5; 

boundaryField
{
    left
    {
        type            symmetryPlane;
    }
    right
    {
        type            nutkWallFunction;
        value           $internalField;
    }
    front
    {
        type            nutkWallFunction;
        value           $internalField;
    }
    back
    {
        type            nutkWallFunction;
        value           $internalField;
    }
    bottom_wall
    {
        type            nutkWallFunction;
        value           $internalField;
    }
    top
    {
        type            nutkWallFunction;
        value           $internalField;
    }
    nozzle_27mm_5mm_m
    {
        type            nutkWallFunction;
        value           $internalField;
    }
    nozzle
    {
        type            calculated;
        value           $internalField;
    }
    vent_lower
    {
        type            calculated;
        value           $internalField;
    }
    vent_upper
    {
        type            calculated;
        value           $internalField;
    }
}
// ************************************************************************* //
